rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37_TCD_1.h
/*! @name TCD6_ATTR - TCD Transfer Attributes */
/*! @{ */

#define TCD_1_TCD6_ATTR_DSIZE_MASK               (0x7U)
#define TCD_1_TCD6_ATTR_DSIZE_SHIFT              (0U)
#define TCD_1_TCD6_ATTR_DSIZE_WIDTH              (3U)
#define TCD_1_TCD6_ATTR_DSIZE(x)                 (((uint16_t)(((uint16_t)(x)) << TCD_1_TCD6_ATTR_DSIZE_SHIFT)) & TCD_1_TCD6_ATTR_DSIZE_MASK)

#define TCD_1_TCD6_ATTR_DMOD_MASK                (0xF8U)
#define TCD_1_TCD6_ATTR_DMOD_SHIFT               (3U)
#define TCD_1_TCD6_ATTR_DMOD_WIDTH               (5U)
#define TCD_1_TCD6_ATTR_DMOD(x)                  (((uint16_t)(((uint16_t)(x)) << TCD_1_TCD6_ATTR_DMOD_SHIFT)) & TCD_1_TCD6_ATTR_DMOD_MASK)

#define TCD_1_TCD6_ATTR_SSIZE_MASK               (0x700U)
#define TCD_1_TCD6_ATTR_SSIZE_SHIFT              (8U)
#define TCD_1_TCD6_ATTR_SSIZE_WIDTH              (3U)
#define TCD_1_TCD6_ATTR_SSIZE(x)                 (((uint16_t)(((uint16_t)(x)) << TCD_1_TCD6_ATTR_SSIZE_SHIFT)) & TCD_1_TCD6_ATTR_SSIZE_MASK)

#define TCD_1_TCD6_ATTR_SMOD_MASK                (0xF800U)
#define TCD_1_TCD6_ATTR_SMOD_SHIFT               (11U)
#define TCD_1_TCD6_ATTR_SMOD_WIDTH               (5U)
#define TCD_1_TCD6_ATTR_SMOD(x)                  (((uint16_t)(((uint16_t)(x)) << TCD_1_TCD6_ATTR_SMOD_SHIFT)) & TCD_1_TCD6_ATTR_SMOD_MASK)
/*! @} */

/*! @name TCD6_NBYTES_MLOFFNO - TCD Transfer Size Without Minor Loop Offsets */
/*! @{ */

#define TCD_1_TCD6_NBYTES_MLOFFNO_NBYTES_MASK    (0x3FFFFFFFU)
#define TCD_1_TCD6_NBYTES_MLOFFNO_NBYTES_SHIFT   (0U)
#define TCD_1_TCD6_NBYTES_MLOFFNO_NBYTES_WIDTH   (30U)
#define TCD_1_TCD6_NBYTES_MLOFFNO_NBYTES(x)      (((uint32_t)(((uint32_t)(x)) << TCD_1_TCD6_NBYTES_MLOFFNO_NBYTES_SHIFT)) & TCD_1_TCD6_NBYTES_MLOFFNO_NBYTES_MASK)

#define TCD_1_TCD6_NBYTES_MLOFFNO_DMLOE_MASK     (0x40000000U)
#define TCD_1_TCD6_NBYTES_MLOFFNO_DMLOE_SHIFT    (30U)
#define TCD_1_TCD6_NBYTES_MLOFFNO_DMLOE_WIDTH    (1U)
#define TCD_1_TCD6_NBYTES_MLOFFNO_DMLOE(x)       (((uint32_t)(((uint32_t)(x)) << TCD_1_TCD6_NBYTES_MLOFFNO_DMLOE_SHIFT)) & TCD_1_TCD6_NBYTES_MLOFFNO_DMLOE_MASK)

#define TCD_1_TCD6_NBYTES_MLOFFNO_SMLOE_MASK     (0x80000000U)
#define TCD_1_TCD6_NBYTES_MLOFFNO_SMLOE_SHIFT    (31U)
#define TCD_1_TCD6_NBYTES_MLOFFNO_SMLOE_WIDTH    (1U)
#define TCD_1_TCD6_NBYTES_MLOFFNO_SMLOE(x)       (((uint32_t)(((uint32_t)(x)) << TCD_1_TCD6_NBYTES_MLOFFNO_SMLOE_SHIFT)) & TCD_1_TCD6_NBYTES_MLOFFNO_SMLOE_MASK)
/*! @} */

/*! @name TCD6_NBYTES_MLOFFYES - TCD Transfer Size with Minor Loop Offsets */
/*! @{ */

#define TCD_1_TCD6_NBYTES_MLOFFYES_NBYTES_MASK   (0x3FFU)
#define TCD_1_TCD6_NBYTES_MLOFFYES_NBYTES_SHIFT  (0U)
#define TCD_1_TCD6_NBYTES_MLOFFYES_NBYTES_WIDTH  (10U)
#define TCD_1_TCD6_NBYTES_MLOFFYES_NBYTES(x)     (((uint32_t)(((uint32_t)(x)) << TCD_1_TCD6_NBYTES_MLOFFYES_NBYTES_SHIFT)) & TCD_1_TCD6_NBYTES_MLOFFYES_NBYTES_MASK)

#define TCD_1_TCD6_NBYTES_MLOFFYES_MLOFF_MASK    (0x3FFFFC00U)
#define TCD_1_TCD6_NBYTES_MLOFFYES_MLOFF_SHIFT   (10U)
#define TCD_1_TCD6_NBYTES_MLOFFYES_MLOFF_WIDTH   (20U)
#define TCD_1_TCD6_NBYTES_MLOFFYES_MLOFF(x)      (((uint32_t)(((uint32_t)(x)) << TCD_1_TCD6_NBYTES_MLOFFYES_MLOFF_SHIFT)) & TCD_1_TCD6_NBYTES_MLOFFYES_MLOFF_MASK)

#define TCD_1_TCD6_NBYTES_MLOFFYES_DMLOE_MASK    (0x40000000U)
#define TCD_1_TCD6_NBYTES_MLOFFYES_DMLOE_SHIFT   (30U)
#define TCD_1_TCD6_NBYTES_MLOFFYES_DMLOE_WIDTH   (1U)
#define TCD_1_TCD6_NBYTES_MLOFFYES_DMLOE(x)      (((uint32_t)(((uint32_t)(x)) << TCD_1_TCD6_NBYTES_MLOFFYES_DMLOE_SHIFT)) & TCD_1_TCD6_NBYTES_MLOFFYES_DMLOE_MASK)

#define TCD_1_TCD6_NBYTES_MLOFFYES_SMLOE_MASK    (0x80000000U)
#define TCD_1_TCD6_NBYTES_MLOFFYES_SMLOE_SHIFT   (31U)
#define TCD_1_TCD6_NBYTES_MLOFFYES_SMLOE_WIDTH   (1U)
#define TCD_1_TCD6_NBYTES_MLOFFYES_SMLOE(x)      (((uint32_t)(((uint32_t)(x)) << TCD_1_TCD6_NBYTES_MLOFFYES_SMLOE_SHIFT)) & TCD_1_TCD6_NBYTES_MLOFFYES_SMLOE_MASK)
/*! @} */

/*! @name TCD6_SLAST_SDA - TCD Last Source Address Adjustment / Store DADDR Address */
/*! @{ */

#define TCD_1_TCD6_SLAST_SDA_SLAST_SDA_MASK      (0xFFFFFFFFU)
#define TCD_1_TCD6_SLAST_SDA_SLAST_SDA_SHIFT     (0U)
#define TCD_1_TCD6_SLAST_SDA_SLAST_SDA_WIDTH     (32U)
#define TCD_1_TCD6_SLAST_SDA_SLAST_SDA(x)        (((uint32_t)(((uint32_t)(x)) << TCD_1_TCD6_SLAST_SDA_SLAST_SDA_SHIFT)) & TCD_1_TCD6_SLAST_SDA_SLAST_SDA_MASK)
/*! @} */

/*! @name TCD6_DADDR - TCD Destination Address */
/*! @{ */

#define TCD_1_TCD6_DADDR_DADDR_MASK              (0xFFFFFFFFU)
#define TCD_1_TCD6_DADDR_DADDR_SHIFT             (0U)
#define TCD_1_TCD6_DADDR_DADDR_WIDTH             (32U)
#define TCD_1_TCD6_DADDR_DADDR(x)                (((uint32_t)(((uint32_t)(x)) << TCD_1_TCD6_DADDR_DADDR_SHIFT)) & TCD_1_TCD6_DADDR_DADDR_MASK)
/*! @} */

/*! @name TCD6_DOFF - TCD Signed Destination Address Offset */
/*! @{ */

#define TCD_1_TCD6_DOFF_DOFF_MASK                (0xFFFFU)
#define TCD_1_TCD6_DOFF_DOFF_SHIFT               (0U)
#define TCD_1_TCD6_DOFF_DOFF_WIDTH               (16U)
#define TCD_1_TCD6_DOFF_DOFF(x)                  (((uint16_t)(((uint16_t)(x)) << TCD_1_TCD6_DOFF_DOFF_SHIFT)) & TCD_1_TCD6_DOFF_DOFF_MASK)
/*! @} */

/*! @name TCD6_CITER_ELINKNO - TCD Current Major Loop Count (Minor Loop Channel Linking Disabled) */
/*! @{ */

#define TCD_1_TCD6_CITER_ELINKNO_CITER_MASK      (0x7FFFU)
#define TCD_1_TCD6_CITER_ELINKNO_CITER_SHIFT     (0U)
#define TCD_1_TCD6_CITER_ELINKNO_CITER_WIDTH     (15U)
#define TCD_1_TCD6_CITER_ELINKNO_CITER(x)        (((uint16_t)(((uint16_t)(x)) << TCD_1_TCD6_CITER_ELINKNO_CITER_SHIFT)) & TCD_1_TCD6_CITER_ELINKNO_CITER_MASK)

#define TCD_1_TCD6_CITER_ELINKNO_ELINK_MASK      (0x8000U)
#define TCD_1_TCD6_CITER_ELINKNO_ELINK_SHIFT     (15U)
#define TCD_1_TCD6_CITER_ELINKNO_ELINK_WIDTH     (1U)
#define TCD_1_TCD6_CITER_ELINKNO_ELINK(x)        (((uint16_t)(((uint16_t)(x)) << TCD_1_TCD6_CITER_ELINKNO_ELINK_SHIFT)) & TCD_1_TCD6_CITER_ELINKNO_ELINK_MASK)
/*! @} */

/*! @name TCD6_CITER_ELINKYES - TCD Current Major Loop Count (Minor Loop Channel Linking Enabled) */
/*! @{ */

#define TCD_1_TCD6_CITER_ELINKYES_CITER_MASK     (0x1FFU)
#define TCD_1_TCD6_CITER_ELINKYES_CITER_SHIFT    (0U)
#define TCD_1_TCD6_CITER_ELINKYES_CITER_WIDTH    (9U)
#define TCD_1_TCD6_CITER_ELINKYES_CITER(x)       (((uint16_t)(((uint16_t)(x)) << TCD_1_TCD6_CITER_ELINKYES_CITER_SHIFT)) & TCD_1_TCD6_CITER_ELINKYES_CITER_MASK)

#define TCD_1_TCD6_CITER_ELINKYES_LINKCH_MASK    (0x3E00U)
#define TCD_1_TCD6_CITER_ELINKYES_LINKCH_SHIFT   (9U)
#define TCD_1_TCD6_CITER_ELINKYES_LINKCH_WIDTH   (5U)
#define TCD_1_TCD6_CITER_ELINKYES_LINKCH(x)      (((uint16_t)(((uint16_t)(x)) << TCD_1_TCD6_CITER_ELINKYES_LINKCH_SHIFT)) & TCD_1_TCD6_CITER_ELINKYES_LINKCH_MASK)

#define TCD_1_TCD6_CITER_ELINKYES_ELINK_MASK     (0x8000U)
#define TCD_1_TCD6_CITER_ELINKYES_ELINK_SHIFT    (15U)
#define TCD_1_TCD6_CITER_ELINKYES_ELINK_WIDTH    (1U)
#define TCD_1_TCD6_CITER_ELINKYES_ELINK(x)       (((uint16_t)(((uint16_t)(x)) << TCD_1_TCD6_CITER_ELINKYES_ELINK_SHIFT)) & TCD_1_TCD6_CITER_ELINKYES_ELINK_MASK)
/*! @} */

/*! @name TCD6_DLAST_SGA - TCD Last Destination Address Adjustment / Scatter Gather Address */
/*! @{ */

