rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37_TCD_1.h
#define TCD_1_TCD9_BITER_ELINKNO_BITER_MASK      (0x7FFFU)
#define TCD_1_TCD9_BITER_ELINKNO_BITER_SHIFT     (0U)
#define TCD_1_TCD9_BITER_ELINKNO_BITER_WIDTH     (15U)
#define TCD_1_TCD9_BITER_ELINKNO_BITER(x)        (((uint16_t)(((uint16_t)(x)) << TCD_1_TCD9_BITER_ELINKNO_BITER_SHIFT)) & TCD_1_TCD9_BITER_ELINKNO_BITER_MASK)

#define TCD_1_TCD9_BITER_ELINKNO_ELINK_MASK      (0x8000U)
#define TCD_1_TCD9_BITER_ELINKNO_ELINK_SHIFT     (15U)
#define TCD_1_TCD9_BITER_ELINKNO_ELINK_WIDTH     (1U)
#define TCD_1_TCD9_BITER_ELINKNO_ELINK(x)        (((uint16_t)(((uint16_t)(x)) << TCD_1_TCD9_BITER_ELINKNO_ELINK_SHIFT)) & TCD_1_TCD9_BITER_ELINKNO_ELINK_MASK)
/*! @} */

/*! @name TCD9_BITER_ELINKYES - TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled) */
/*! @{ */

#define TCD_1_TCD9_BITER_ELINKYES_BITER_MASK     (0x1FFU)
#define TCD_1_TCD9_BITER_ELINKYES_BITER_SHIFT    (0U)
#define TCD_1_TCD9_BITER_ELINKYES_BITER_WIDTH    (9U)
#define TCD_1_TCD9_BITER_ELINKYES_BITER(x)       (((uint16_t)(((uint16_t)(x)) << TCD_1_TCD9_BITER_ELINKYES_BITER_SHIFT)) & TCD_1_TCD9_BITER_ELINKYES_BITER_MASK)

#define TCD_1_TCD9_BITER_ELINKYES_LINKCH_MASK    (0x3E00U)
#define TCD_1_TCD9_BITER_ELINKYES_LINKCH_SHIFT   (9U)
#define TCD_1_TCD9_BITER_ELINKYES_LINKCH_WIDTH   (5U)
#define TCD_1_TCD9_BITER_ELINKYES_LINKCH(x)      (((uint16_t)(((uint16_t)(x)) << TCD_1_TCD9_BITER_ELINKYES_LINKCH_SHIFT)) & TCD_1_TCD9_BITER_ELINKYES_LINKCH_MASK)

#define TCD_1_TCD9_BITER_ELINKYES_ELINK_MASK     (0x8000U)
#define TCD_1_TCD9_BITER_ELINKYES_ELINK_SHIFT    (15U)
#define TCD_1_TCD9_BITER_ELINKYES_ELINK_WIDTH    (1U)
#define TCD_1_TCD9_BITER_ELINKYES_ELINK(x)       (((uint16_t)(((uint16_t)(x)) << TCD_1_TCD9_BITER_ELINKYES_ELINK_SHIFT)) & TCD_1_TCD9_BITER_ELINKYES_ELINK_MASK)
/*! @} */

/*! @name CH10_CSR - Channel Control and Status */
/*! @{ */

#define TCD_1_CH10_CSR_ERQ_MASK                  (0x1U)
#define TCD_1_CH10_CSR_ERQ_SHIFT                 (0U)
#define TCD_1_CH10_CSR_ERQ_WIDTH                 (1U)
#define TCD_1_CH10_CSR_ERQ(x)                    (((uint32_t)(((uint32_t)(x)) << TCD_1_CH10_CSR_ERQ_SHIFT)) & TCD_1_CH10_CSR_ERQ_MASK)

#define TCD_1_CH10_CSR_EARQ_MASK                 (0x2U)
#define TCD_1_CH10_CSR_EARQ_SHIFT                (1U)
#define TCD_1_CH10_CSR_EARQ_WIDTH                (1U)
#define TCD_1_CH10_CSR_EARQ(x)                   (((uint32_t)(((uint32_t)(x)) << TCD_1_CH10_CSR_EARQ_SHIFT)) & TCD_1_CH10_CSR_EARQ_MASK)

#define TCD_1_CH10_CSR_EEI_MASK                  (0x4U)
#define TCD_1_CH10_CSR_EEI_SHIFT                 (2U)
#define TCD_1_CH10_CSR_EEI_WIDTH                 (1U)
#define TCD_1_CH10_CSR_EEI(x)                    (((uint32_t)(((uint32_t)(x)) << TCD_1_CH10_CSR_EEI_SHIFT)) & TCD_1_CH10_CSR_EEI_MASK)

#define TCD_1_CH10_CSR_EBW_MASK                  (0x8U)
#define TCD_1_CH10_CSR_EBW_SHIFT                 (3U)
#define TCD_1_CH10_CSR_EBW_WIDTH                 (1U)
#define TCD_1_CH10_CSR_EBW(x)                    (((uint32_t)(((uint32_t)(x)) << TCD_1_CH10_CSR_EBW_SHIFT)) & TCD_1_CH10_CSR_EBW_MASK)

#define TCD_1_CH10_CSR_DONE_MASK                 (0x40000000U)
#define TCD_1_CH10_CSR_DONE_SHIFT                (30U)
#define TCD_1_CH10_CSR_DONE_WIDTH                (1U)
#define TCD_1_CH10_CSR_DONE(x)                   (((uint32_t)(((uint32_t)(x)) << TCD_1_CH10_CSR_DONE_SHIFT)) & TCD_1_CH10_CSR_DONE_MASK)

#define TCD_1_CH10_CSR_ACTIVE_MASK               (0x80000000U)
#define TCD_1_CH10_CSR_ACTIVE_SHIFT              (31U)
#define TCD_1_CH10_CSR_ACTIVE_WIDTH              (1U)
#define TCD_1_CH10_CSR_ACTIVE(x)                 (((uint32_t)(((uint32_t)(x)) << TCD_1_CH10_CSR_ACTIVE_SHIFT)) & TCD_1_CH10_CSR_ACTIVE_MASK)
/*! @} */

/*! @name CH10_ES - Channel Error Status */
/*! @{ */

#define TCD_1_CH10_ES_DBE_MASK                   (0x1U)
#define TCD_1_CH10_ES_DBE_SHIFT                  (0U)
#define TCD_1_CH10_ES_DBE_WIDTH                  (1U)
#define TCD_1_CH10_ES_DBE(x)                     (((uint32_t)(((uint32_t)(x)) << TCD_1_CH10_ES_DBE_SHIFT)) & TCD_1_CH10_ES_DBE_MASK)

#define TCD_1_CH10_ES_SBE_MASK                   (0x2U)
#define TCD_1_CH10_ES_SBE_SHIFT                  (1U)
#define TCD_1_CH10_ES_SBE_WIDTH                  (1U)
#define TCD_1_CH10_ES_SBE(x)                     (((uint32_t)(((uint32_t)(x)) << TCD_1_CH10_ES_SBE_SHIFT)) & TCD_1_CH10_ES_SBE_MASK)

#define TCD_1_CH10_ES_SGE_MASK                   (0x4U)
#define TCD_1_CH10_ES_SGE_SHIFT                  (2U)
#define TCD_1_CH10_ES_SGE_WIDTH                  (1U)
#define TCD_1_CH10_ES_SGE(x)                     (((uint32_t)(((uint32_t)(x)) << TCD_1_CH10_ES_SGE_SHIFT)) & TCD_1_CH10_ES_SGE_MASK)

#define TCD_1_CH10_ES_NCE_MASK                   (0x8U)
#define TCD_1_CH10_ES_NCE_SHIFT                  (3U)
#define TCD_1_CH10_ES_NCE_WIDTH                  (1U)
#define TCD_1_CH10_ES_NCE(x)                     (((uint32_t)(((uint32_t)(x)) << TCD_1_CH10_ES_NCE_SHIFT)) & TCD_1_CH10_ES_NCE_MASK)

#define TCD_1_CH10_ES_DOE_MASK                   (0x10U)
#define TCD_1_CH10_ES_DOE_SHIFT                  (4U)
#define TCD_1_CH10_ES_DOE_WIDTH                  (1U)
#define TCD_1_CH10_ES_DOE(x)                     (((uint32_t)(((uint32_t)(x)) << TCD_1_CH10_ES_DOE_SHIFT)) & TCD_1_CH10_ES_DOE_MASK)

#define TCD_1_CH10_ES_DAE_MASK                   (0x20U)
#define TCD_1_CH10_ES_DAE_SHIFT                  (5U)
#define TCD_1_CH10_ES_DAE_WIDTH                  (1U)
#define TCD_1_CH10_ES_DAE(x)                     (((uint32_t)(((uint32_t)(x)) << TCD_1_CH10_ES_DAE_SHIFT)) & TCD_1_CH10_ES_DAE_MASK)

#define TCD_1_CH10_ES_SOE_MASK                   (0x40U)
#define TCD_1_CH10_ES_SOE_SHIFT                  (6U)
#define TCD_1_CH10_ES_SOE_WIDTH                  (1U)
#define TCD_1_CH10_ES_SOE(x)                     (((uint32_t)(((uint32_t)(x)) << TCD_1_CH10_ES_SOE_SHIFT)) & TCD_1_CH10_ES_SOE_MASK)

#define TCD_1_CH10_ES_SAE_MASK                   (0x80U)
#define TCD_1_CH10_ES_SAE_SHIFT                  (7U)
#define TCD_1_CH10_ES_SAE_WIDTH                  (1U)
#define TCD_1_CH10_ES_SAE(x)                     (((uint32_t)(((uint32_t)(x)) << TCD_1_CH10_ES_SAE_SHIFT)) & TCD_1_CH10_ES_SAE_MASK)

#define TCD_1_CH10_ES_ERR_MASK                   (0x80000000U)
#define TCD_1_CH10_ES_ERR_SHIFT                  (31U)
#define TCD_1_CH10_ES_ERR_WIDTH                  (1U)
#define TCD_1_CH10_ES_ERR(x)                     (((uint32_t)(((uint32_t)(x)) << TCD_1_CH10_ES_ERR_SHIFT)) & TCD_1_CH10_ES_ERR_MASK)
/*! @} */

